AcDbPathRef.evaluateAndCacheGeometry
Calls evaluateAndCacheGeometry() on all the owned AcDbEdgeRefs.

AcDbPathRef.isReferencePath
Returns true if all elements of the path are references to entities, i.e.
they are not constant geometries.

AcDbPathRef.isEqualTo(AcGeCurve3d!System.Runtime.CompilerServices.IsConst*)
Returns true if the geometry of the path is equal to the geometry of the given curve.

AcDbPathRef.edgeRefs
Returns the array of AcDbEdgeRefs kept in the AcDbPathRef.

AcDbPathRef.getEntityArray(AcArray&lt;AcDbEntity**,AcArrayMemCopyReallocator&lt;AcDbEntity**&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.Boolean)
Returns an array of AcDbEntities created from the individual AcDbEdgeRefs
in the path. If concatenate is true, it tries to concatenate them.

AcDbPathRef.setEdgeRefs(AcArray&lt;AcDbEdgeRef,AcArrayObjectCopyReallocator&lt;AcDbEdgeRef&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Sets the AcDbPathRef from a sequence of AcDbEdgeRefs.

AcDbPathRef.#ctor(AcArray&lt;AcDbFullSubentPath,AcArrayObjectCopyReallocator&lt;AcDbFullSubentPath&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,AcArray&lt;AcDbFullSubentPath,AcArrayObjectCopyReallocator&lt;AcDbFullSubentPath&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Constructor an AcDbPathRef that is a sequence of connected edges.
edgeSubentPathArr:
Subent paths of the edges that make up the path.
faceSubentPathArr:
Optional subent paths of the faces for each edge.  The number of elements in
this array must be 0 or be the same as the number of elements in
edgeSubentPathArr.

AcDbPathRef.#ctor(AcArray&lt;AcDbEdgeRef,AcArrayObjectCopyReallocator&lt;AcDbEdgeRef&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
Creates an AcDbPathRef from a sequence of AcDbEdgeRefs.

AcDbPathRef.#ctor
Default constructor.

AcDbPathRef
Reference to a path, which is just a sequence of edges. If the path has an
array of edges which happen to be connected at their end points, it will try
to concatenate the curves into one composite curve.